export const howIBecomeDevelopper = `
  僕は、国際基督教大学を2年時の終わりに休学、その後退学し、現在はWebエンジニアをしている。ここでは、僕が大学をやめてからエンジニアになるまでの経緯を書いておこうと思う。

  ## 冬になると死にたくなる

  大学2年時の冬、僕の精神はひどい状態だった。毎日「死にたい」と考えていたと思う。僕はもともと、冬になると気分が重くなったり、性格が変わってしまうようなことが昔からあった。医師に診断をされたりしても、自分の中では「冬になると性格変わるなんて、漫画じゃないんだから」と思っていた。しかし、2011-2012の冬、いろいろなことが祟(たた)って、意志の力ではどうにもならないほどに心を病んでしまった。「冬季うつ病」を認識した時だった。

  ## 「この世には制限がある」という考えが鬱を呼ぶ

  その当時、ひとつだけ、鬱につながったかもしれない、と思う思考回路が当時の僕の中にあった。それが「生きていれば必ず制限がある」という考え方だった。

  容姿や性別、髪や肌の色、生まれた場所、育った環境、過去に起きた大抵のことはコントロール出来ないし、変えられない。例えば、自分で選択してきたと思っている、どの大学に入るだとか、誰のことを好きになったっだとか、どこへ行きたいだとか、それらすべても、おそらく、本人が選択したことはかなり少ないのではないかと、僕は思っていた。実際は、「選択させられている」のだ、と。

  僕は、この時、コントロール出来ないことにばかり目を向けてしまっていた。当然、人生に対してポジティブなイメージも全くなく、そんな状況で大学生活は続けられなかった。僕は、両親と話し、一時休学することにした。

  ## やりたいことがわからなかったので、とりあえず無一文でオーストラリアにゆく

  休学中は、休養と、ありがちだが、自分のやりたいことを模索していた。初めはなにがやりたいのかもわからなかったが、ひとつだけ強く考えていたのは「冬から逃れたい」ということだった。

  僕は、冬季うつ病を逃れるために、日本が冬の間は暖かい国へゆこう、と考えていた。行き先も、特に深くは考えず、友人も住んでいたので、オーストラリアに決めた。

  そして11月、ほとんど無一文に近い状態でオーストラリアへゆき、ヒッチハイクをしながら食べ物を恵んでもらったりなどをして生き延びた。その時は「ここで死ぬか、無事に帰ってヒーローになるか」だと考えていた。最終的に、警察にお世話になって、予定よりも何倍も早く日本に帰国した。

  そもそも死にたくなって大学を辞めた人間に、何かを実現するパワーはなかったのだと思う。いや、パワーはパワーでも、絶対的にネガティブなエネルギーだけが高まっていた。いま振り返っても、あの精神状態でよく(いろんな意味で)無事だったな、と思う。

  ## 休学をして何もなし遂げられなかった惨めさ

  反省点は数え切れないほどあるが、2点重要な事があった。

  ### 1.自分のスキルでは何もできない

  1点目は、「自分のスキルでは何もできない」とわかったことだった。根拠のない自信は打ち砕かれ、自分は、社会の中では無意味な存在以下なのだということを思い知らされた。この経験から、「自分のやりたいことだけをして生活ができるスキル」を身に着けたいと考えるようになった。

  ### 2.ネガティブなイメージからはネガティブな結果しか生まれない

  2点目は、「ネガティブなイメージからはネガティブな結果しか生まれない」とわかったことだった。そりゃ、1年間ほぼすべての時間を「死にたい」と考えて過ごしていたら、当然良いことは起こらないだろう。

  僕はいまでも「即死したい」とは思うが、苦しい思いをするのはもうゴメンだ、と考えていて、病院も決め、うつ病ともうまく付き合ってゆこうと決めた。同時に、人生における「制限」のことばかり考えるのではなく、それをどうすれば解決できるかに頭のリソースをつかうことにした。

  最初はしんどかった(本当にしんどかった)。なにせ、オーストラリアから帰ってきた時はまだ冬で、また、そのプライドは惨めに打ち砕かれていたからだ。1日じゅう、泣いているか、輪っかを首にかけているかという生活をしていた。僕は病院にゆき、でき得る対策はすべて行なった。

  結果として、思考というのは長い時間をかければある程度コントロールすることができるということがわかった。

  ## プログラミングを学ぶ

  いろんな人にあってゆく中で、その時住んでいたシェアハウスにいた知り合いに「何か新しいこと始めたら？」といわれ、そして始めたのが「HTML」だった。始めた途端、僕はのめり込んだ。こんなに面白いパズルがこの世にあったのか、と思い、文字通り、朝起きてから夜寝るまでひたすらやっていた。

  インターンなどを通して、人に会ううちに、とあるスタートアップに出会い、フロントエンドからサーバーサイドまでひと通りさわった。そして、2013/8には大学をやめていた。

  ## 現在

  現在は、JavaScriptエンジニアをしていて、

  \`\`\`
  ①最先端の技術を思う存分試せる(＝やりたいことができる)環境
  ②冬の間、暖かい国で仕事ができる環境
  \`\`\`

  と、長らく思っていたライフスタイルが実現できていて嬉しい。ライフスタイル=>ワークスタイルという順番で考えることは大事かなと思っている。

  ## 今後

  プログラミングは趣味なので、基本的には、楽しくコードを書いて行けたらそれでいいと考えている。その上で、\`技術\`と\`プロダクト\`という2つの軸がある。技術に関しては、モダンなJavaScriptを頑張りたい。プロダクトに関しては、なにか想いのあるものを作れると良い。

  また、プログラミングに限らず、IoT・VR・AI・ロボット・ビッグデータ・物理学など、面白そうな技術に投資してゆきたい。もっといろんな分野・世界で活躍できると良い。

  ライフスタイルについても、**枠組みから抜け出せばもっといろいろな可能性がある**、ということを伝えてゆきたい。

  `;
